{
  "name": "Maciej",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Maciej Koziol -",
  "headerTaglineThree": "Data Scientist",
  "headerTaglineFour": " based in Chicago, IL",
  "showCursor": false,
  "showBlog": false,
  "darkMode": true,
  "showResume": true,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "https://github.com/maciek02kz"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/koziol-maciej/"
    },
    {
      "id": "3",
      "title": "Email",
      "link": "mailto:maciek02kz@gmail.com"
    }
  ],
  "projects": [
    {
      "id": "1",
      "title": "Project One Test",
      "description": "Web Design",
      "imageSrc": "/images/ava2.png"
    },
    {
      "id": "2",
      "title": "Project Two",
      "description": "Web Development",
      "imageSrc": "/images/avaalso.png"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Art Direction",
      "description": "We help with the creation and development of online advertising ideas, with particular focus on their visual appearance."
    },
    {
      "id": "2",
      "title": "Branding",
      "description": "We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."
    },
    {
      "id": "3",
      "title": "Web Design",
      "description": "We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."
    },
    {
      "id": "4",
      "title": "3D Design",
      "description": "We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."
    }
  ],
  "aboutpara": "I'm Maciej Koziol, a Data Scientist who enjoys turning complex data into clear, actionable insights. I have experience building predictive models and engineering scalable data pipelines using Python, SQL, and tools like GCP, Looker, and Power BI.\n\nWhen I'm not focused on optimizing operational workflows or forecasting project costs, you can find me pushing my limits as an ultra-distance runner. I recently ran the Chicago Marathon and am currently training for my ultimate goal of becoming an Ironman — I bring that same dedication and problem-solving endurance from my training to my data work.\n\nI'm currently looking to transition into a Data Scientist role in New York City and am excited about connecting with new teams and taking on fresh challenges.",
  "resume": {
    "tagline": "Data Scientist with experience in developing predictive models and data-driven solutions to optimize operational workflows.",
    "description": "Highly skilled in Python (Scikit-learn, Pandas, Matplotlib), SQL, Cloud Platforms (GCP, AWS, BigQuery), and visualization tools (PowerBI, Tableau, Looker) for end-to-end data science projects.",
    "experiences": [
      {
        "id": "1",
        "dates": "June 2025 - Present",
        "type": "Full Time",
        "position": "Data Scientist at Collins Engineers, Inc. (Chicago, IL)",
        "bullets": "Built predictive models using Python (Scikit-learn, Pandas) to forecast project costs, driving a 25% reduction in operational expenses, Led end-to-end development of internal dashboards by collaborating across multiple teams and cutting project costs by 45%, Engineered automated data ingestion and feature engineering pipelines in Python and SQL (GCP) for scalable ML deployment, Developed financial analytics reports for 2026 budgeting across 15 U.S. offices in collaboration with the CFO, Analyzed historical HR data to identify key factors behind high employee turnover and revealed actionable retention insights, Partnered with HR and Engineering teams to transform raw ERP data into KPIs and Power BI dashboards, Presented data-driven findings to executives translating complex model outputs into clear business recommendations"
      },
      {
        "id": "2",
        "dates": "May 2023 - September 2024",
        "type": "Internship",
        "position": "Data Analyst Intern at Collins Engineers, Inc. (Chicago, IL)",
        "bullets": "Developed and maintained Tableau and Looker dashboards leveraging SQL and DAX to deliver near real-time insights into client requests and resource usage, Designed efficient data extracts for Hennepin County parsing over 100 terabytes of client data to provide faster and more sustainable analytics portals, Collaborated on the iterative development and deployment of a modern asset and inventory management tool for multiple state DOTs integrating QA automation and version control"
      }
    ],
    "education": {
      "universityName": "University of Wisconsin-Madison (Madison, WI)",
      "universityDate": "2025",
      "universityPara": "B.S. in Computer Science. Coursework includes Database Management, Optimization, Discrete Math, Computer Graphics, Algorithms, and Physics."
    },
    "languages": [
      "Python",
      "SQL",
      "Java",
      "JavaScript",
      "C",
      "C++",
      "DAX",
      "MongoDB",
      "Polish (Fluent)"
    ],
    "frameworks": [
      "Scikit-learn",
      "NLP",
      "Full-Stack",
      "Django",
      "Agile"
    ],
    "others": [
      "GCP",
      "AWS",
      "BigQuery",
      "Looker",
      "PowerBI",
      "Tableau",
      "Data Management",
      "Algorithms",
      "Git"
    ]
  }
}